tutorials/multiphaseEuler/steamInjection/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.*"
    {
        nCorrectors     1;
        nSubCycles      3;
    }

    p_rgh
    {
        solver          GAMG;
        smoother        DIC;

        tolerance       1e-8;
        relTol          0.01;
        maxIter         20;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    "U.*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;

        tolerance       1e-6;
        relTol          0;
    }

    "(e|h).*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;

        tolerance       1e-8;
        relTol          0;
        maxIter         20;
    }

    "(k|epsilon).*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;

        tolerance       1e-8;
        relTol          0;
    }

    "Yi.*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;

        tolerance       1e-8;
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors    2;
    nCorrectors         2;
    nNonOrthogonalCorrectors 0;
    nEnergyCorrectors   2;

    faceMomentum        no;
    VmDdtCorrection     yes;
    dragCorrection      yes;
}

relaxationFactors
{
    fields
    {
        phaseChange:mDot 1;
    }

    equations
    {
        ".*"            1;
    }
}


// ************************************************************************* //
